# Ebay Car Sales Data
This project aims to investigate the variation in the number of used cars from eBay kleinanzeigen website. The dataset was downloaded from Kaggle with slight pre-defined alterations, including 50,000 data points extracted from the originial dataset. <br>

Data dictionary is listed below with explanation:
* **dateCrawled** - When this ad was first crawled. All field-values are taken from this date.
* **name** - Name of the car.
* **seller** - Whether the seller is private or a dealer.
* **offerType** - The type of listing
* **price** - The price on the ad to sell the car.
* **abtest** - Whether the listing is included in an A/B test.
* **vehicleType** - The vehicle Type.
* **yearOfRegistration** - The year in which which year the car was first registered.
* **gearbox** - The transmission type.
* **powerPS** - The power of the car in PS.
* **model** - The car model name.
* **kilometer** - How many kilometers the car has driven.
* **monthOfRegistration** - The month in which which year the car was first registered.
* **fuelType** - What type of fuel the car uses.
* **brand** - The brand of the car.
* **notRepairedDamage** - If the car has a damage which is not yet repaired.
* **dateCreated** - The date on which the eBay listing was created.
* **nrOfPictures** - The number of pictures in the ad.
* **postalCode** - The postal code for the location of the vehicle.
* **lastSeenOnline** - When the crawler saw this ad last online.

##Loading and Cleaning data

In [0]:
# Including necessary libraries for investigation
import numpy as np
import pandas as pd

In [0]:
# Load file from Github
url = "https://raw.githubusercontent.com/lamtran1309/side-projects/master/Ebay%20Car%20Sales/autos.csv?token=AI4VQC4KD3DBIQSFQYZOLMK5HO2QA"
df = pd.read_csv(url, encoding ="Latin-1")

In [3]:
df.head(11) #print the first ten records with header as the first row

            dateCrawled  ...             lastSeen
0   2016-03-26 17:47:46  ...  2016-04-06 06:45:54
1   2016-04-04 13:38:56  ...  2016-04-06 14:45:08
2   2016-03-26 18:57:24  ...  2016-04-06 20:15:37
3   2016-03-12 16:58:10  ...  2016-03-15 03:16:28
4   2016-04-01 14:38:50  ...  2016-04-01 14:38:50
5   2016-03-21 13:47:45  ...  2016-04-06 09:45:21
6   2016-03-20 17:55:21  ...  2016-03-23 02:48:59
7   2016-03-16 18:55:19  ...  2016-04-07 03:17:32
8   2016-03-22 16:51:34  ...  2016-03-26 18:18:10
9   2016-03-16 13:47:02  ...  2016-04-06 10:46:35
10  2016-03-15 01:41:36  ...  2016-04-07 03:16:21

[11 rows x 20 columns]

In [4]:
# Summary info about the dataset:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50000 entries, 0 to 49999
Data columns (total 20 columns):
dateCrawled            50000 non-null object
name                   50000 non-null object
seller                 50000 non-null object
offerType              50000 non-null object
price                  50000 non-null object
abtest                 50000 non-null object
vehicleType            44905 non-null object
yearOfRegistration     50000 non-null int64
gearbox                47320 non-null object
powerPS                50000 non-null int64
model                  47242 non-null object
odometer               50000 non-null object
monthOfRegistration    50000 non-null int64
fuelType               45518 non-null object
brand                  50000 non-null object
notRepairedDamage      40171 non-null object
dateCreated            50000 non-null object
nrOfPictures           50000 non-null int64
postalCode             50000 non-null int64
lastSeen               50000 non-null object
dtypes: int64(5), object(15)
memory usage: 7.6+ MB

It can be seen from the summary above that the dataset has 20 columns in total. Some columns, such as `vehicleType`, `gearbox` or `fuelType` have null values. In addition, the column names were written in camelcase instead of preferred snakecase. Therefore, the column names will be modified accordingly in the next step.

## Cleaning Column Names

In [5]:
# Original column names
df.columns

Index(['dateCrawled', 'name', 'seller', 'offerType', 'price', 'abtest',
       'vehicleType', 'yearOfRegistration', 'gearbox', 'powerPS', 'model',
       'odometer', 'monthOfRegistration', 'fuelType', 'brand',
       'notRepairedDamage', 'dateCreated', 'nrOfPictures', 'postalCode',
       'lastSeen'],
      dtype='object')

In [0]:
# Modify the camelcase column names to snakecase column names
df.columns = [
    'date_crawled', 'name', 'seller', 'offer_type', 'price', 'abtest',
    'vehicle_type', 'registration_year', 'gearbox', 'power_ps', 'model',
    'odometer_km', 'registration_month', 'fuel_type', 'brand',
    'unrepaired_damage', 'ad_created', 'nr_of_pictures', 'postal_code',
    'last_seen'
]

In [7]:
df.head(1)

          date_crawled  ...            last_seen
0  2016-03-26 17:47:46  ...  2016-04-06 06:45:54

[1 rows x 20 columns]

## Starting Investigation and Data Cleaning
As text columns are less valuable with regards to information, more focus is shifted to numeric data.

In [8]:
df.describe()

       registration_year      power_ps  ...  nr_of_pictures   postal_code
count       50000.000000  50000.000000  ...         50000.0  50000.000000
mean         2005.073280    116.355920  ...             0.0  50813.627300
std           105.712813    209.216627  ...             0.0  25779.747957
min          1000.000000      0.000000  ...             0.0   1067.000000
25%          1999.000000     70.000000  ...             0.0  30451.000000
50%          2003.000000    105.000000  ...             0.0  49577.000000
75%          2008.000000    150.000000  ...             0.0  71540.000000
max          9999.000000  17700.000000  ...             0.0  99998.000000

[8 rows x 5 columns]

Comparing this summary table to original dataset, we can notice that there are some attributes that should be appeared but missing due to its type in string: such as `price` and `odometer`.

In [9]:
df["price"].unique()

array(['$5,000', '$8,500', '$8,990', ..., '$385', '$22,200', '$16,995'],
      dtype=object)

In [0]:
#Since the value was written in string, we will convert it to float number
df["price"] = df["price"].str.replace("$","") # remove the $ sign
df["price"] = df["price"].str.replace(",","") # remove the , sign
df["price"] = df["price"].astype(float)       # convert into float number

In [0]:
#Similar procedure is conducted for odometer_km
df["odometer_km"] = df["odometer_km"].str.replace("km","") # remove the $ sign
df["odometer_km"] = df["odometer_km"].str.replace(",","") # remove the , sign
df["odometer_km"] = df["odometer_km"].astype(float)       # convert into float number

## Studying the Price and Odometer Columns
Two attributes are studied in details in terms of a number of factors

In [12]:
print("Unique values of price")
df["price"].unique().shape

Unique values of price

(2357,)

In [13]:
print("Basic statistical measurement of price")
df["price"].describe()

Basic statistical measurement of price

count    5.000000e+04
mean     9.840044e+03
std      4.811044e+05
min      0.000000e+00
25%      1.100000e+03
50%      2.950000e+03
75%      7.200000e+03
max      1.000000e+08
Name: price, dtype: float64

In [14]:
print("Value counts of price")
df["price"].value_counts().head(10)

Value counts of price

0.0       1421
500.0      781
1500.0     734
2500.0     643
1200.0     639
1000.0     639
600.0      531
800.0      498
3500.0     498
2000.0     460
Name: price, dtype: int64

In [15]:
print("Unique values of odometer_km")
df["odometer_km"].unique().shape

Unique values of odometer_km

(13,)

In [16]:
print("Basic statistical measurement of odometer_km")
df["odometer_km"].describe()

Basic statistical measurement of odometer_km

count     50000.000000
mean     125732.700000
std       40042.211706
min        5000.000000
25%      125000.000000
50%      150000.000000
75%      150000.000000
max      150000.000000
Name: odometer_km, dtype: float64

In [17]:
print("Value counts of odometer_km")
df["odometer_km"].value_counts().head(10)

Value counts of odometer_km

150000.0    32424
125000.0     5170
100000.0     2169
90000.0      1757
80000.0      1436
70000.0      1230
60000.0      1164
50000.0      1027
5000.0        967
40000.0       819
Name: odometer_km, dtype: int64

## Studying the date columns
Within this dataset, five columns representing date values are **date_crawled**, **last_seen**, **ad_created**, **registration_month** and **registration_year**. The former two are added by the crawler while the latter three are created from the website automatically. It should be noted also that **date_crawled**, **last_seen**, and **ad_created** are written in string; therefore, it should be converted into numeric data. for further use.

In [18]:
# Some examples of three string date columns
df[["date_crawled", "ad_created", "last_seen"]][0:10]

          date_crawled           ad_created            last_seen
0  2016-03-26 17:47:46  2016-03-26 00:00:00  2016-04-06 06:45:54
1  2016-04-04 13:38:56  2016-04-04 00:00:00  2016-04-06 14:45:08
2  2016-03-26 18:57:24  2016-03-26 00:00:00  2016-04-06 20:15:37
3  2016-03-12 16:58:10  2016-03-12 00:00:00  2016-03-15 03:16:28
4  2016-04-01 14:38:50  2016-04-01 00:00:00  2016-04-01 14:38:50
5  2016-03-21 13:47:45  2016-03-21 00:00:00  2016-04-06 09:45:21
6  2016-03-20 17:55:21  2016-03-20 00:00:00  2016-03-23 02:48:59
7  2016-03-16 18:55:19  2016-03-16 00:00:00  2016-04-07 03:17:32
8  2016-03-22 16:51:34  2016-03-22 00:00:00  2016-03-26 18:18:10
9  2016-03-16 13:47:02  2016-03-16 00:00:00  2016-04-06 10:46:35

In [19]:
df["registration_year"].describe()

count    50000.000000
mean      2005.073280
std        105.712813
min       1000.000000
25%       1999.000000
50%       2003.000000
75%       2008.000000
max       9999.000000
Name: registration_year, dtype: float64

It is noticeable that the there were mistakes in the data of `registraton_year`. Infact, the minimum and maximum value were 1000 and 9000 respectively. which are infeasible. It is suggested that to have the registration_year in the parameter of 1900-2018, any data outside would be removed.

##Fixing incorrect registration_year data

In [20]:
df.loc[~df["registration_year"].between(1899, 2017), "registration_year"].shape

(519,)

In [0]:
# replace these incorrect numbers with NaN
df.loc[~df["registration_year"].between(1899, 2017), "registration_year"] = np.nan

In [0]:
# remove NaN value
df.dropna(subset=["registration_year"], axis=0, inplace=True)

In [23]:
df['registration_year'].value_counts(normalize=True)

2000.0    0.067784
2005.0    0.060932
1999.0    0.060629
2004.0    0.055314
2003.0    0.055112
2006.0    0.054728
2001.0    0.054627
2002.0    0.051191
1998.0    0.049575
2007.0    0.046563
2008.0    0.045088
2009.0    0.042400
1997.0    0.040985
2011.0    0.033023
2010.0    0.032275
2017.0    0.029365
1996.0    0.029183
2012.0    0.026738
2016.0    0.026596
1995.0    0.026535
2013.0    0.016289
2014.0    0.013460
1994.0    0.013338
1993.0    0.008993
2015.0    0.008064
1990.0    0.007983
1992.0    0.007902
1991.0    0.007195
1989.0    0.003658
1988.0    0.002870
            ...
1977.0    0.000445
1966.0    0.000445
1975.0    0.000384
1969.0    0.000384
1965.0    0.000344
1964.0    0.000243
1910.0    0.000182
1963.0    0.000182
1959.0    0.000141
1961.0    0.000121
1956.0    0.000101
1962.0    0.000081
1958.0    0.000081
1937.0    0.000081
1950.0    0.000061
1934.0    0.000040
1941.0    0.000040
1951.0    0.000040
1954.0    0.000040
1955.0    0.000040
1957.0    0.000040
1952.0    0.000020
1953.0    0.000020
1948.0    0.000020
1943.0    0.000020
1939.0    0.000020
1938.0    0.000020
1931.0    0.000020
1929.0    0.000020
1927.0    0.000020
Name: registration_year, Length: 79, dtype: float64

## Studying the relationship between price and mileage
The price and mileage across various car brands are analzyed and compared to idenfity the relationship

In [24]:
# List ou the car brand
df["brand"].unique()

array(['peugeot', 'bmw', 'volkswagen', 'smart', 'ford', 'chrysler',
       'seat', 'renault', 'mercedes_benz', 'audi', 'sonstige_autos',
       'opel', 'mazda', 'porsche', 'mini', 'toyota', 'dacia', 'nissan',
       'jeep', 'saab', 'volvo', 'mitsubishi', 'jaguar', 'fiat', 'skoda',
       'subaru', 'kia', 'citroen', 'chevrolet', 'hyundai', 'honda',
       'daewoo', 'suzuki', 'trabant', 'land_rover', 'alfa_romeo', 'lada',
       'rover', 'daihatsu', 'lancia'], dtype=object)

In [25]:
df["brand"].value_counts()

volkswagen        10566
opel               5391
bmw                5383
mercedes_benz      4690
audi               4254
ford               3451
renault            2368
peugeot            1449
fiat               1288
seat                915
skoda               782
mazda               751
nissan              749
smart               695
citroen             693
toyota              615
sonstige_autos      534
hyundai             485
volvo               454
mini                424
mitsubishi          399
honda               391
kia                 353
alfa_romeo          327
porsche             293
suzuki              289
chevrolet           279
chrysler            181
dacia               128
daihatsu            126
jeep                109
subaru              107
land_rover           99
saab                 78
daewoo               78
trabant              77
jaguar               76
rover                69
lancia               56
lada                 29
Name: brand, dtype: int64

In [26]:
brand_avg_prices = {}
brands = df["brand"].unique()

for brand in brands:
  brand_avg_prices[brand] = df.loc[df["brand"] == brand, "price"].mean()
  
brand_avg_prices

{'alfa_romeo': 3955.4495412844035,
 'audi': 8989.552891396334,
 'bmw': 8279.482258963404,
 'chevrolet': 6496.311827956989,
 'chrysler': 3286.0552486187844,
 'citroen': 43097.88888888889,
 'dacia': 5920.3828125,
 'daewoo': 1049.1025641025642,
 'daihatsu': 1535.4603174603174,
 'fiat': 12276.558229813665,
 'ford': 7140.0625905534625,
 'honda': 3928.2762148337597,
 'hyundai': 5303.065979381443,
 'jaguar': 11176.197368421053,
 'jeep': 11377.550458715596,
 'kia': 5724.385269121813,
 'lada': 2502.896551724138,
 'lancia': 3057.339285714286,
 'land_rover': 18934.272727272728,
 'mazda': 3968.7709720372836,
 'mercedes_benz': 29704.757995735607,
 'mini': 10392.393867924528,
 'mitsubishi': 3320.187969924812,
 'nissan': 4589.3564753004,
 'opel': 5143.339454646633,
 'peugeot': 3014.3381642512077,
 'porsche': 44553.46757679181,
 'renault': 2364.367820945946,
 'rover': 1494.5217391304348,
 'saab': 3192.269230769231,
 'seat': 4259.546448087432,
 'skoda': 6300.735294117647,
 'smart': 3494.264748201439,
 'sonstige_autos': 39098.70599250936,
 'subaru': 3702.1401869158876,
 'suzuki': 4028.59169550173,
 'toyota': 5101.678048780488,
 'trabant': 1557.2077922077922,
 'volkswagen': 6417.041169789892,
 'volvo': 4690.112334801762}

In [27]:
brand_avg_mileage = {}
brands = df["brand"].unique()

for brand in brands:
  brand_avg_mileage[brand] = df.loc[df["brand"] == brand, "odometer_km"].mean()
  
brand_avg_mileage

{'alfa_romeo': 131437.30886850154,
 'audi': 129561.58909261871,
 'bmw': 132520.89912688092,
 'chevrolet': 99014.33691756273,
 'chrysler': 133149.17127071825,
 'citroen': 119834.05483405484,
 'dacia': 84218.75,
 'daewoo': 121346.15384615384,
 'daihatsu': 115714.28571428571,
 'fiat': 116836.1801242236,
 'ford': 124058.24398725007,
 'honda': 123631.71355498722,
 'hyundai': 106690.72164948453,
 'jaguar': 120921.05263157895,
 'jeep': 127522.93577981651,
 'kia': 112719.54674220963,
 'lada': 85517.24137931035,
 'lancia': 123125.0,
 'land_rover': 118333.33333333333,
 'mazda': 124933.42210386152,
 'mercedes_benz': 131041.57782515991,
 'mini': 89375.0,
 'mitsubishi': 126904.76190476191,
 'nissan': 118951.93591455274,
 'opel': 129326.65553700613,
 'peugeot': 127311.939268461,
 'porsche': 97457.33788395904,
 'renault': 128230.57432432432,
 'rover': 136449.27536231885,
 'saab': 144487.1794871795,
 'seat': 122027.32240437159,
 'skoda': 111074.16879795397,
 'smart': 100489.20863309353,
 'sonstige_autos': 87303.37078651685,
 'subaru': 125327.10280373832,
 'suzuki': 109290.65743944637,
 'toyota': 116105.69105691057,
 'trabant': 60064.93506493507,
 'volkswagen': 128976.4338444066,
 'volvo': 138557.26872246695}

In [28]:
# Combine the data from both series objects into a single dataframe
brand_avg_prices = pd.Series(brand_avg_prices)
brand_avg_mileage = pd.Series(brand_avg_mileage)
brand_avg = pd.DataFrame(brand_avg_prices, columns = ["avg_prices"])
brand_avg["avg_mileage"] = brand_avg_mileage
brand_avg

                  avg_prices    avg_mileage
peugeot          3014.338164  127311.939268
bmw              8279.482259  132520.899127
volkswagen       6417.041170  128976.433844
smart            3494.264748  100489.208633
ford             7140.062591  124058.243987
chrysler         3286.055249  133149.171271
seat             4259.546448  122027.322404
renault          2364.367821  128230.574324
mercedes_benz   29704.757996  131041.577825
audi             8989.552891  129561.589093
sonstige_autos  39098.705993   87303.370787
opel             5143.339455  129326.655537
mazda            3968.770972  124933.422104
porsche         44553.467577   97457.337884
mini            10392.393868   89375.000000
toyota           5101.678049  116105.691057
dacia            5920.382812   84218.750000
nissan           4589.356475  118951.935915
jeep            11377.550459  127522.935780
saab             3192.269231  144487.179487
volvo            4690.112335  138557.268722
mitsubishi       3320.187970  126904.761905
jaguar          11176.197368  120921.052632
fiat            12276.558230  116836.180124
skoda            6300.735294  111074.168798
subaru           3702.140187  125327.102804
kia              5724.385269  112719.546742
citroen         43097.888889  119834.054834
chevrolet        6496.311828   99014.336918
hyundai          5303.065979  106690.721649
honda            3928.276215  123631.713555
daewoo           1049.102564  121346.153846
suzuki           4028.591696  109290.657439
trabant          1557.207792   60064.935065
land_rover      18934.272727  118333.333333
alfa_romeo       3955.449541  131437.308869
lada             2502.896552   85517.241379
rover            1494.521739  136449.275362
daihatsu         1535.460317  115714.285714
lancia           3057.339286  123125.000000